
import PIL
from PIL import Image, ImageDraw #відбувається імпорт потрібної бібліотеки та модулів з неї
f1=open('DS1.txt', 'r') #відкриваємо потрібний нам файл, у цьому випадко - текстовий файл з заданими точками
data=f1.readlines() #читаємо дані з цього файлу
xy=[] #створюєио список, де будуть збережені кординати з заданого файлу
for i in data: #використовуючи ітератор розділяємо кожен елемент списку data на кординати та перетворюємо їх у цілі числа
    x,y=i.split(" ") #розділяємо кординати, що були записані у одному рядку
    xy.append(int(y)) #для того, щоб зображення засувало заданому співвідношенню сторін - міняємо х та у місцями, тоді зображенні повністю ляже на полотно
    xy.append(int(x))

print(xy) #для перевірки виводимо отриманий масив у0х0у1х1...утхm

im = PIL.Image.new(mode = "RGB", size = (960,540), color = (255, 255, 255) )#створюємо зображення з білим фоном, колірною системою RGB та розміром, що був вказаний у завданні
draw=PIL.ImageDraw.Draw(im) #додаємо можливість малювати у у цьому файлі
draw.point(xy, fill=(0,0,0)) #маюємо точки, що були вказані у списку ху, заповнюючи їх чорним кольором
im.show()#виводимо результат
im.save("DS1 painted.png","PNG")#та зберігаємо його у папці проекту